import { CourseHero } from '@/components/shared';
import { linuxProminent } from '@/data/prominent';
import React from 'react';

const TypeScript = () => {
  return (
    <>
      <CourseHero
        heading="লিনাক্স"
        desc={` Linux একটি ওপেন সোর্স, ইউনিক্স-ভিত্তিক অপারেটিং সিস্টেম, যা স্ট্যাবিলিটি, নিরাপত্তা এবং কাস্টমাইজেশনের জন্য জনপ্রিয়। এটি লিনুস টরভাল্ডস ১৯৯১ সালে তৈরি করেন এবং পরবর্তীতে বিশ্বব্যাপী ডেভেলপারদের সমর্থনে উন্নত হয়। Linux কার্নেলকে কেন্দ্র করে বিভিন্ন ডিস্ট্রিবিউশন (যেমন Ubuntu, Fedora, Debian, Arch) তৈরি করা হয়েছে, যা ব্যক্তিগত ব্যবহার থেকে শুরু করে সার্ভার, ক্লাউড, এম্বেডেড সিস্টেম এবং সুপারকম্পিউটার পর্যন্ত বিস্তৃতভাবে ব্যবহৃত হয়। শক্তিশালী কমান্ড লাইন ইন্টারফেস (CLI), মাল্টি-ইউজার ও মাল্টি-টাস্কিং সাপোর্ট, উচ্চ নিরাপত্তা এবং কম রিসোর্স ব্যবহারের ক্ষমতা Linux-এর অন্যতম বৈশিষ্ট্য। এটি বিনামূল্যে ব্যবহারের জন্য উন্মুক্ত এবং সফটওয়্যার ডেভেলপার, সিস্টেম অ্যাডমিনিস্ট্রেটর, এবং সাইবার সিকিউরিটি বিশেষজ্ঞদের কাছে বিশেষভাবে জনপ্রিয়। `}
        prominentList={linuxProminent}
      />
    </>
  );
};

export default TypeScript;
