import { Prominent } from '.';

export const gitProminent: Prominent[] = [
  {
    label: 'ওপেন সোর্স',
    desc: 'Git একটি ওপেন সোর্স ভাষা, যার মানে এটি ফ্রি এবং সকলের জন্য উন্মুক্ত।'
  },
  {
    label: 'ডিস্ট্রিবিউটেড ভার্সন কন্ট্রোল',
    desc: 'Git একটি ডিস্ট্রিবিউটেড ভার্সন কন্ট্রোল সিস্টেম, যা দূর থেকে কাজ করতে সক্ষম করে।'
  },
  {
    label: 'লাইটওয়েট',
    desc: 'Git একটি লাইটওয়েট ভাষা, যার মানে এটি দ্রুত কাজ করতে সক্ষম করে।'
  },
  {
    label: 'ফাস্ট এবং সহজ',
    desc: 'Git একটি ফাস্ট এবং সহজ ভাষা, যা দ্রুত কাজ করতে সক্ষম করে এবং ব্যবহার করা সহজ।'
  }
];
