import { Prominent } from '.';

export const jsProminent: Prominent[] = [
  {
    label: 'সিঙ্গেল থ্রেডেড',
    desc: 'JavaScript একটি সিঙ্গেল থ্রেডেড ভাষা, যার মানে এটি একসাথে একটাই থ্রেড ব্যবহার করে  করতে পারে।'
  },
  {
    label: 'ডায়নামিক টাইপড',
    desc: 'ভেরিয়েবলগুলোর ধরন রানটাইমে নির্ধারিত হয়, কোনো নির্দিষ্ট টাইপ ডিক্লেয়ার করতে হয় না।'
  },
  {
    label: 'উইকলি টাইপড',
    desc: 'JavaScript-এর টাইপ সিস্টেম দুর্বল, তাই ভিন্ন টাইপের ভেরিয়েবল একসাথে মার্জ করা বা পরিবর্তন  করা সম্ভব।'
  },
  {
    label: 'প্রোটোটাইপ-নির্ভর',
    desc: 'এটি ক্লাস-বেসড ইনহেরিট্যান্সের পরিবর্তে প্রোটোটাইপ-ভিত্তিক ইনহেরিট্যান্স ব্যবহার করে, __proto__ ব্যবহার করে।'
  },
  {
    label: 'মাল্টি-প্যারাডাইম',
    desc: 'JavaScript একইসাথে  ফাংশনাল, অবজেক্ট-ওরিয়েন্টেড, এবং ইভেন্ট-ড্রিভেন প্রোগ্রামিং ইত্যাদি স্টাইল সাপোর্ট করে।'
  },
  {
    label: 'অ্যাসিনক্রোনাস ও ইভেন্ট-ড্রিভেন',
    desc: 'JavaScript নন-ব্লকিং I/O এবং ইভেন্ট-লুপ ব্যবহার করে অ্যাসিনক্রোনাস অপারেশন পরিচালনা করে।'
  },
  {
    label: 'ইন্টারপ্রেটেড ভাষা',
    desc: 'JavaScript ব্রাউজারে সরাসরি রান হয় এবং কম্পাইলারের প্রয়োজন হয় না। ও লাইন বাই লাইন এক্সিকিউট হয়'
  },
  {
    label: 'ফার্স্ট-ক্লাস ফাংশন',
    desc: 'ফাংশনগুলোকে ভেরিয়েবল হিসেবে রাখা যায়, আর্গুমেন্ট হিসেবে পাঠানো যায়, এবং অন্য ফাংশন থেকে রিটার্ন করা যায়।'
  },
  {
    label: 'হাই-লেভেল ভাষা',
    desc: 'JavaScript কমপ্লেক্স মেমোরি ম্যানেজমেন্ট হ্যান্ডেল যা ডেভেলপারদের নিজে হ্যান্ডেল করা প্রয়োজন পরে না  ।'
  },
  {
    label: 'ক্লায়েন্ট-সাইড ও সার্ভার-সাইড',
    desc: 'Node.js, deno, bun ইত্যাদি ব্যবহার করে JavaScript ব্রাইজার ছাড়াও  ব্যাকএন্ডেও ব্যবহার করা যায়।'
  },
  {
    label: 'গারবেজ কালেকশন',
    desc: 'অপ্রয়োজনীয় মেমোরি ব্যবহারের পর JavaScript নিজে থেকেই  তা মুক্ত করে দেয়।'
  },
  {
    label: 'DOM Manipulation',
    desc: 'JavaScript ব্যবহার করে ওয়েবপেজের কনটেন্ট ডাইনামিকভাবে পরিবর্তন করা যায়।'
  },
  {
    label: 'JSON সাপোর্ট',
    desc: 'JavaScript JSON (JavaScript Object Notation) ডেটা ফরম্যাটের জন্য নেটিভ সাপোর্ট করে'
  },
  {
    label: 'মডুলার সাপোর্ট (ES6+)',
    desc: 'ECMAScript 6 থেকে import/export ব্যবহারের মাধ্যমে মডুলার কোড লিখতে পারা যায়।'
  },
  {
    label: 'ব্রাউজার কম্প্যাটিবিলিটি',
    desc: 'JavaScript প্রায় সব ব্রাউজারে সমর্থিত এবং প্লাগিন ছাড়া রান করা যায়।'
  }
];
