import { Prominent } from '.';

export const typeScriptProminent: Prominent[] = [
  {
    label: 'স্ট্যাটিক টাইপড',
    desc: 'TypeScript একটি স্ট্যাটিক টাইপড ল্যাংগুয়েজ, যেখানে ভেরিয়েবলগুলোর টাইপ কম্পাইল টাইমে নির্ধারিত হয়,ফলে টাইপ সংক্রান্ত Error বা Bug আগে থেকেই ধরা যায়।'
  },
  {
    label: 'স্ট্রংলি টাইপড',
    desc: 'TypeScript-এর টাইপ সিস্টেম শক্তিশালী, যার ফলে টাইপ কনভার্শন বা মার্জ করতে গেলে নির্দিষ্ট শর্ত পূরণ করতে হয়।'
  },
  {
    label: 'কম্পাইল-ভিত্তিক',
    desc: 'TypeScript সরাসরি ব্রাউজারে রান হয় না, এটি JavaScript-এ কম্পাইল করা হয় এবং তারপর এক্সিকিউট হয়।'
  },
  {
    label: 'অবজেক্ট-ওরিয়েন্টেড সাপোর্ট',
    desc: 'TypeScript ক্লাস, ইন্টারফেস, এনাম ইত্যাদির মাধ্যমে পূর্ণাঙ্গ অবজেক্ট-ওরিয়েন্টেড প্রোগ্রামিং সাপোর্ট করে।'
  },
  {
    label: 'ইন্টারফেস ও টাইপ অ্যালিয়াস',
    desc: 'ইন্টারফেস ও টাইপ অ্যালিয়াস ব্যবহার করে অবজেক্টের টাইপ ডিফাইন করা যায়, যা কোডের রি-ইউজিবিলিটি বৃদ্ধি করে।'
  },
  {
    label: 'জেনেরিক্স সাপোর্ট',
    desc: 'জেনেরিক্স ব্যবহার করে কোডকে আরও ফ্লেক্সিবল করা যায়, যেখানে টাইপ ডিফাইন  ডায়নামিকভাবে করা সম্ভব।'
  },
  {
    label: 'নাল সেফটি',
    desc: 'TypeScript এ  Null  ও undefined সংক্রান্ত Error বা  Bug  প্রতিরোধ করতে স্ট্রিক্ট চেকিং করে, ফলে রানটাইম এরর কম হয়।'
  },
  {
    label: 'ডেকোরেটর সাপোর্ট',
    desc: 'TypeScript ডেকোরেটর ফিচার সাপোর্ট করে , যা মেটাডেটা যুক্ত করতে ও কোড মডিফাই করতে ব্যবহৃত হয়।'
  },
  {
    label: 'মডুলার কোডিং (ES মডিউল)',
    desc: 'import/export ব্যবহার করে বড় প্রোজেক্টকে ছোট ছোট মডিউলে ভাগ করে কোড ম্যানেজ করা যায়।'
  },
  {
    label: 'অটো-কমপ্লিশন ও ইনটেলিসেন্স',
    desc: 'TypeScript উন্নত কোড এডিটরগুলোর জন্য ইনটেলিসেন্স ও অটো-কমপ্লিশন সুবিধা প্রদান করে, যা ডেভেলপমেন্টকে সহজ করে।'
  },
  {
    label: 'Strict Mode',
    desc: 'TypeScript-এর strict mode ব্যবহার করলে টাইপ চেকিং আরও শক্তিশালী হয়, যা সম্ভাব্য Bug প্রতিরোধ করতে সহায়তা করে।'
  },
  {
    label: 'Type Inference',
    desc: 'TypeScript নিজে থেকেই টাইপ অনুমান করতে পারে, তাই সব সময় টাইপ ডিক্লেয়ার করার প্রয়োজন হয় না।'
  },
  {
    label: 'ফাংশন ও মেথড ওভারলোডিং',
    desc: 'একই নামে একাধিক ফাংশন বা মেথড এসাইন  করা যায়, সম্ভাব্য ইরোর আগেই ক্যাচ করতে পারে '
  },
  {
    label: 'ব্রাউজার ও ফ্রেমওয়ার্ক কম্প্যাটিবিলিটি',
    desc: 'TypeScript Angular, React, Vue সহ প্রায় সব ফ্রেমওয়ার্ক ও মডার্ন ব্রাউজারে সাপোর্টেড। (যেহেতু দিন শেষে JavaScript এই কম্পাইল হয়)  '
  },
  {
    label: 'Enforced Best Practices',
    desc: 'TypeScript-এর স্ট্রিক্ট টাইপ চেকিং ও লিন্টিং সুবিধা  বেস্ট প্রাকটিস ফলো করতে ইনফোর্স করে'
  }
];
